-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- Хост: localhost
-- Время создания: Фев 25 2020 г., 07:02
-- Версия сервера: 8.0.13-4
-- Версия PHP: 7.2.24-0ubuntu0.18.04.3

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `wLhC3u9El4`
--

-- --------------------------------------------------------

--
-- Структура таблицы `ACCOUNT`
--

CREATE TABLE `ACCOUNT` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `CODE` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'код пользователя',
  `LOGIN` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'логин пользователя',
  `PASSWORD` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'пароль пользователя (зашифрованный)',
  `SURNAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'фамилия пользователя',
  `NAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'имя пользователя',
  `PATRONYMIC` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'отчество пользователя',
  `ADRESS` varchar(1000) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'адрес пользователя (зашифрованный)',
  `PHONE` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'телефон пользователя (зашифрованный)',
  `SEX` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'пол пользователя',
  `PURCHASE_INVOICE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак создания приходных накладных',
  `SALES_INVOICE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак создания расходных накладных',
  `REPORTS` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к отчетам',
  `REPORT_PURCHASE_INVOICE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к отчетам по чужим приходным накладным',
  `REPORT_UN_ISSUE_PURCHASE_INVOICE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак отмены проведения приходных накладных',
  `REPORT_SALES_INVOICE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к отчетам по чужим расходным накладным',
  `REPORT_UN_ISSUE_SALES_INVOICE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак отмены проведения расходных накладных',
  `REPORT_INCOME_EXPENSE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к отчету по балансу',
  `COUNTERPARTY` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к контрагентам',
  `COUNTERPARTY_PROVIDER` tinyint(1) DEFAULT '0' COMMENT 'признак доступа к поставщикам',
  `COUNTERPARTY_PROVIDER_ADD` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак добавления поставщиков',
  `COUNTERPARTY_PROVIDER_EDIT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак редактирования поставщиков',
  `COUNTERPARTY_PROVIDER_DELETE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулирования поставщиков',
  `COUNTERPARTY_CUSTOMER` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к покупателям',
  `COUNTERPARTY_CUSTOMER_ADD` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак добавления покупателей',
  `COUNTERPARTY_CUSTOMER_EDIT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак редактирования покупателей',
  `COUNTERPARTY_CUSTOMER_DELETE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулирования покупателей',
  `WAREHOUSE` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к управлению складом',
  `WAREHOUSE_ADD_PRODUCT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак добавления вида товара',
  `WAREHOUSE_EDIT_PRODUCT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак редактирования вида товара',
  `WAREHOUSE_ANNULATE_PRODUCT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулирования вида товара',
  `WAREHOUSE_EDIT_COUNT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак редактирования количества товара',
  `ADMIN_PANEL` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к административной панели',
  `ADMIN_PANEL_ADD_ACCOUNT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак добавления пользователей',
  `ADMIN_PANEL_EDIT_ACCOUNT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак редактирования пользователей',
  `ADMIN_PANEL_DELETE_ACCOUNT` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулирования пользователей',
  `ADMIN_PANEL_SET_NUMERATOR` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак установки нумератора',
  `ADMIN_PANEL_JOURNAL` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак доступа к журналу событий',
  `IS_ANNULATED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулированного пользователя'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Учетная запись пользователя' ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `ACCOUNT`
--

INSERT INTO `ACCOUNT` (`ID`, `CODE`, `LOGIN`, `PASSWORD`, `SURNAME`, `NAME`, `PATRONYMIC`, `ADRESS`, `PHONE`, `SEX`, `PURCHASE_INVOICE`, `SALES_INVOICE`, `REPORTS`, `REPORT_PURCHASE_INVOICE`, `REPORT_UN_ISSUE_PURCHASE_INVOICE`, `REPORT_SALES_INVOICE`, `REPORT_UN_ISSUE_SALES_INVOICE`, `REPORT_INCOME_EXPENSE`, `COUNTERPARTY`, `COUNTERPARTY_PROVIDER`, `COUNTERPARTY_PROVIDER_ADD`, `COUNTERPARTY_PROVIDER_EDIT`, `COUNTERPARTY_PROVIDER_DELETE`, `COUNTERPARTY_CUSTOMER`, `COUNTERPARTY_CUSTOMER_ADD`, `COUNTERPARTY_CUSTOMER_EDIT`, `COUNTERPARTY_CUSTOMER_DELETE`, `WAREHOUSE`, `WAREHOUSE_ADD_PRODUCT`, `WAREHOUSE_EDIT_PRODUCT`, `WAREHOUSE_ANNULATE_PRODUCT`, `WAREHOUSE_EDIT_COUNT`, `ADMIN_PANEL`, `ADMIN_PANEL_ADD_ACCOUNT`, `ADMIN_PANEL_EDIT_ACCOUNT`, `ADMIN_PANEL_DELETE_ACCOUNT`, `ADMIN_PANEL_SET_NUMERATOR`, `ADMIN_PANEL_JOURNAL`, `IS_ANNULATED`) VALUES
(1, '', 'admin', 'Ë¥²ÁÝÂ¹xªÃÅ¦Ý°ð¼ÄÎ¿ ¥°¦Ñ½nÐí¬àé©­¬¸ªÇº¥ß~¥Ã­Ø·Ì»¿¯È¬¯ÒÔÝ', 'Ряполов', 'Александр', 'Николаевич', '', '', 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0),
(4, '', 'tkachenko', 'æ­¥³Íé°v¡¤ãç·äÆÕáÂî·ëÈ¿®áêÇ»¿~ª·Á§ôµ»æÊ¯¿¨¾', 'Ткаченко', 'Виктория', 'Викторовна', '', '', 0, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 0),
(5, '', 'gil', 'Þ´«äº¬¢´Ô­Áò¿¥à´Î¶Î«~¾Ç§¹ÀÀ¬q¹¼¤­Ø¥ÀÑ°ÓÏâë', 'Гиль', 'Ольга', 'Наумовна', '', '', 0, 0, 1, 1, 0, 0, 1, 1, 0, 1, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(6, '', 'tchesnokov', 'ÂµÃ½´zv¢ Ó´ÅñÑ¥µ½´¨¶¦¸à×¨±åÀÀ¤}©tÐ®¥Ò¨ÊÈÀÚ×Ê¨ÂºÙ', 'Чесноков', 'Сергей', 'Витальевич', '', '', 1, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0),
(7, '', 'kudryashova', 'ÂµÃ½´zv¢ Ó´ÅñÑ¥µ½´¨¶¦¸à×¨±åÀÀ¤}©tÐ®¥Ò¨ÊÈÀÚ×Ê¨ÂºÙ', 'Кудряшова', 'Галина', 'Анатольевна', '', '', 0, 0, 1, 1, 0, 0, 0, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `COUNTERPARTY`
--

CREATE TABLE `COUNTERPARTY` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `CODE` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'код контрагента',
  `SURNAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'фамилия контрагента',
  `NAME` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'имя контрагента',
  `PATRONYMIC` varchar(50) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'отчество контрагента',
  `NOMINATION` varchar(500) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'наименование контрагента',
  `ADRESS` varchar(1000) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'адрес контрагента (зашифрованный)',
  `PHONE` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL DEFAULT '' COMMENT 'телефон контрагента (зашифрованный)',
  `IS_PROVIDER` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак поставщика',
  `IS_ANNULATED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулированного контрагента'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Контрагенты' ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `COUNTERPARTY`
--

INSERT INTO `COUNTERPARTY` (`ID`, `CODE`, `SURNAME`, `NAME`, `PATRONYMIC`, `NOMINATION`, `ADRESS`, `PHONE`, `IS_PROVIDER`, `IS_ANNULATED`) VALUES
(7, 'RU000000', '', '', '', 'Покупатель', '', '', 0, 0),
(8, 'CH00000000', '', '', '', 'ООО GreenLeaf', '', '', 1, 0),
(9, 'RU0000001', '', '', '', 'СЦ Москва', '', '', 1, 0),
(10, 'RU0000002', 'Мазаева', 'Татьяна', 'Аркадьевна', 'СЦ Самара', '', '', 1, 0),
(11, 'RU09286130', 'Чесноков', 'Сергей', 'Витальевич', '', '', '', 0, 0),
(12, 'RU05817053', 'Ткаченко', 'Виктория', 'Викторовна', '', '', '', 0, 0),
(13, 'RU03663661', 'Гиль', 'Ольга', 'Наумовна', '', '', '', 0, 0),
(14, 'RU06816698', 'Кудряшова', 'Галина', 'Анатольевна', '', '', '', 0, 0),
(15, 'RU03228570', 'Чураева', 'Лариса', 'Степановна', '', '', '', 0, 0),
(16, 'RU04602788', 'Пудушкина', 'Ирина', 'Александровна', '', '', '', 0, 0),
(17, 'RU05295753', 'Саяпина', 'Татьяна', 'Станиславовна', '', '', '', 0, 0),
(18, 'RU08373255', 'Кузнецова', 'Милания', 'Викторовна', '', '', '', 0, 0),
(19, 'RU06918625', 'Паренская', 'Татьяна', 'Викторовна', '', '', '', 0, 0),
(20, 'RU06041813', 'Гафурова', 'Елена', 'Анатольевна', '', '', '', 0, 0),
(21, 'RU06941115', 'Капкаева', 'Наталья', 'Викторовна', '', '', '', 0, 0),
(22, 'RU03535833', 'Станив', 'Татьяна', 'Фредовна', '', '', '', 0, 0),
(23, 'RU07304455', 'Сыч', 'Мария', 'Ивановна', '', '', '', 0, 0),
(24, 'RU08459351', 'Федосеева', 'Ольга', 'Аркадьевна', '', '', '', 0, 0),
(25, 'RU09223097', 'Позднякова', 'Надежда', 'Ивановна', '', '', '', 0, 0),
(26, 'RU05813420', 'Данилина', 'Наталья', 'Александровна', '', '', '', 0, 0),
(27, 'RU02219746', 'Фурзикова', 'Надежда', 'Константиновна', '', '', '', 0, 0),
(28, 'RU07634826', 'Кияткина', 'Ольга', 'Александровна', '', '', '', 0, 0),
(29, 'RU07765919', 'Жуковец', 'Светлана', 'Григорьевна', '', '', '', 0, 0),
(30, 'RU08412370', 'Паничева', 'Оксана', 'Викторовна', '', '', '', 0, 0),
(31, 'RU05760239', 'Симонова', 'Марина', 'Геннадьевна', '', '', '', 0, 0),
(32, 'RU02431892', 'Вигдорчик', 'Александра', 'Викторовна', '', '', '', 0, 0),
(33, 'RU07201866', 'Шигорина', 'Екатерина', 'Викторовна', '', '', '', 0, 0),
(34, 'RU03994869', 'Мищерина', 'Татьяна', 'Викторовна', '', '', '', 0, 0),
(35, 'RU04736863', 'Салиенко', 'Екатерина', 'Владимировна', '', '', '', 0, 0),
(36, 'RU07460001', 'Тимаева', 'Асия', 'Ринатовна', '', '', '', 0, 0),
(37, 'RU05188085', 'Филимонова', 'Алена', 'Валерьевна', '', '', '', 0, 0),
(38, 'RU04312046', 'Жеребятьева', 'Надежда', 'Алексеевна', '', '', '', 0, 0),
(39, 'RU07778985', 'Тимофеева', 'Елена', 'Гурьевна', '', '', '', 0, 0),
(40, 'RU07358518', 'Сесина', 'Лариса', 'Николаевна', '', '', '', 0, 0),
(41, 'RU03425849', 'Ширлинг', 'Ксения', 'Евгеньевна', '', '', '', 0, 0),
(42, 'RU05345492', 'Кузьмина', 'Маргарита', 'Антоновна', '', '', '', 0, 0),
(43, 'RU02493244', 'Федорова', 'Любовь', 'Николаевна', '', '', '', 0, 0),
(44, 'RU03373463', 'Сухорева', 'Алена', 'Анатольевна', '', '', '', 0, 0),
(45, 'RU06365111', 'Тереева', 'Екатерина', 'Игоревна', '', '', '', 0, 0),
(46, 'RU06179604', 'Морева', 'Инна', 'Александровна', '', '', '', 0, 0),
(47, 'RU05456694', 'Елясина', 'Людмила', 'Михайловна', '', '', '', 0, 0),
(48, 'RU02292348', 'Дмитриева', 'Наталья', '', '', '', '', 0, 0),
(49, '', 'Сабельникова', 'Ольга', 'Федоровна', '', '', '', 0, 0),
(50, 'RU04912639', 'Яковлева', 'Любовь', 'Васильевна', '', '', '', 0, 0),
(51, 'RU09964286', 'Елисеева', 'Ирина', 'Павловна', '', '', '', 0, 0),
(52, 'RU02712105', 'Исакова', 'Людмила', 'Ивановна', '', '', '', 0, 0),
(53, 'RU08922097', 'Кононенко', 'Людмила', 'Владимировна', '', '', '', 0, 0),
(54, 'RU08788225', 'Акимова', 'Ольга', 'Анатольевна', '', '', '', 0, 0),
(55, 'RU030782555', 'Князева', 'Елена', 'Михайловна', '', '', '', 0, 0),
(56, 'RU03084064', 'Куковерова', 'Татьяна', 'Ивановна', '', '', '', 0, 0),
(57, 'RU02318651', 'Телегина', 'Надежда', 'Михайловна', '', '', '', 0, 0),
(58, 'RU02378118', 'Воеводина', 'Евгения', 'Александровна', '', '', '', 0, 0),
(59, 'RU07013155', 'Сайдуллаева', 'Елена', 'Павловна', '', '', '', 0, 0),
(60, 'RU09211692', 'Юрлова', 'Лидия', 'Сергеевна', '', '', '', 0, 0),
(61, 'RU06375899', 'Моисеева', 'Нина', 'Ивановна', '', '', '', 0, 0),
(62, 'RU06758676', 'Салионова', 'Лариса', 'Борисовна', '', '', '', 0, 0),
(63, 'RU04266189', 'Ловина', 'Галина', 'Александровна', '', '', '', 0, 0),
(64, 'RU07675558', 'Плотникова', 'Елена', 'Петровна', '', '', '', 0, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `JOURNAL`
--

CREATE TABLE `JOURNAL` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `DATE` datetime NOT NULL COMMENT 'дата события',
  `ID_ACCOUNT` int(11) NOT NULL COMMENT 'ID пользователя',
  `ACT` varchar(1000) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'описание события'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Журнал событий' ROW_FORMAT=COMPACT;

-- --------------------------------------------------------

--
-- Структура таблицы `NUMERATOR`
--

CREATE TABLE `NUMERATOR` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `NOMINATION` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'наименование нумератора',
  `VALUE` int(11) NOT NULL COMMENT 'значение нумератора'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Нумераторы' ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `NUMERATOR`
--

INSERT INTO `NUMERATOR` (`ID`, `NOMINATION`, `VALUE`) VALUES
(1, 'Приходная накладная', 15),
(2, 'Расходная накладная', 339);

-- --------------------------------------------------------

--
-- Структура таблицы `PRODUCT`
--

CREATE TABLE `PRODUCT` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `PRODUCT_CODE` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'код товара',
  `NOMINATION` varchar(500) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'наименование товара',
  `COUNT_IN_PACKAGE` double NOT NULL COMMENT 'количество в упаковке',
  `COST` double NOT NULL COMMENT 'стоимость реализации',
  `COUPON` double NOT NULL COMMENT 'купон по реализации',
  `COST_PURCHASE` double NOT NULL COMMENT 'закупочная стоимость',
  `COUPON_PURCHASE` double NOT NULL COMMENT 'закупочная стоимость купона',
  `COUNT` double NOT NULL DEFAULT '0' COMMENT 'количество на складе',
  `LOCKED_COUNT` double NOT NULL DEFAULT '0' COMMENT 'заблокированное количество',
  `ID_UNIT` int(11) NOT NULL COMMENT 'ID единицы измерения',
  `IS_ANNULATED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулированного товара'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Товары' ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `PRODUCT`
--

INSERT INTO `PRODUCT` (`ID`, `PRODUCT_CODE`, `NOMINATION`, `COUNT_IN_PACKAGE`, `COST`, `COUPON`, `COST_PURCHASE`, `COUPON_PURCHASE`, `COUNT`, `LOCKED_COUNT`, `ID_UNIT`, `IS_ANNULATED`) VALUES
(12, 'CEA028', 'Carich Натуральные бамбуковые салфетки', 10, 298, 104, 284, 104, 9, 1, 1, 0),
(13, 'DAD030', 'I life Гигиенические прокладки  (ночные)', 100, 68, 53, 61, 53, 81, 15, 1, 0),
(14, 'DAD029', 'I life Гигиенические прокладки  (дневные)', 100, 68, 53, 61, 53, 80, 12, 1, 0),
(15, 'DAD028', 'I life Гигиенические прокладки  (ночные+ удлиненные)', 100, 78, 68, 73, 68, 72, 15, 1, 0),
(16, 'DAD031', 'I life Ежедневные гигиенические прокладки', 100, 84, 68, 80, 68, 134, 8, 1, 0),
(17, 'DAA008', 'I life Натуральная зубная паста на основе водорослей 120g', 60, 109, 38, 103, 38, 21, 18, 1, 0),
(18, 'EAA013', 'YIBEILE Детская зубная паста', 72, 95, 33, 90, 33, 69, 16, 1, 0),
(19, 'ASB017', 'I life Восстановливающий Гель Алоэ', 48, 148, 56, 141, 56, 31, 18, 1, 0),
(20, 'ASB016', 'I life Крем с антиоксидантами', 75, 69, 37, 65, 37, 273, 71, 1, 0),
(21, 'ASB014', 'I life Крем для рук с маслом авокадо', 60, 83, 29, 79, 29, 4, 0, 1, 0),
(22, 'ASB013', 'I life Крем для рук с эссенцией розового масла', 60, 83, 29, 79, 29, 3, 0, 1, 0),
(23, 'SCE004', 'SEALUXE.Антивозрастной компактный СС-кушон（01）', 24, 567, 185, 539, 185, 0, 0, 1, 0),
(24, 'SCE003', 'SEALUXE.Антивозрастной компактный СС-кушон（02）', 24, 567, 185, 539, 185, 7, 1, 1, 0),
(25, 'CBB002', 'Сarich Питающее мыло с маслом ши', 64, 141, 58, 134, 58, 0, 0, 1, 0),
(26, 'SCF007', 'SEALUXE Подводка для глаз  (черный)', 96, 130, 42, 124, 42, 71, 12, 1, 0),
(27, 'SCF002', 'SEALUXE Карандаш для бровей （Классический коричневый，Натуральный коричневый， Мокка-кортчневый, серый）', 96, 84, 30, 80, 30, 25, 3, 1, 0),
(28, 'SCB002', 'SEALUXE Губная помада (13#)', 36, 544, 148, 517, 148, 0, 0, 1, 0),
(29, 'CBC011', 'Carich Влажные салфекти для снятия макияжа（80шт）', 24, 160, 55, 152, 55, 0, 0, 1, 0),
(30, 'CBC010', 'Carich Влажные салфекти для снятия макияжа（30шт）', 60, 59, 20, 56, 20, 0, 0, 1, 0),
(31, 'CBC009', 'Carich Влажные салфекти для снятия макияжа（10шт）', 200, 22, 10, 21, 10, 0, 0, 1, 0),
(32, 'CBC006', 'Carich Детские влажные салфетки (8шт)', 18, 139, 57, 132, 57, 2, 0, 1, 0),
(33, 'DAE047', 'I lifeДетские влажные салфетки (80шт)', 18, 160, 55, 152, 55, 0, 0, 1, 0),
(34, 'CBC002', 'Carich Детские влажные салфетки (80шт)', 24, 160, 51, 141, 48, 0, 0, 1, 0),
(35, 'DAB027', 'Пенка для умывания с зелеными чаями', 20, 262, 213, 249, 210, 0, 0, 1, 0),
(36, 'ASB009', 'I life Увлажняющий крем для лица', 10, 575, 132, 512, 132, 0, 0, 1, 0),
(37, 'ASB008', 'I life Увлажняющий лосьон для лица', 10, 394, 114, 351, 114, 1, 0, 1, 0),
(38, 'ASB007', 'I life Увлажняющий тоник', 10, 347, 102, 309, 102, 0, 0, 1, 0),
(39, 'ASB006', 'I life Увлажняющее и очищающее средство для умывания', 10, 213, 108, 190, 108, 1, 0, 1, 0),
(40, 'ASB001', 'I life Антивозрастная маска для лица', 30, 377, 104, 358, 104, 0, 0, 1, 0),
(41, 'DAB030', 'I life Ампульные сыворотка ', 60, 240, 194, 228, 194, 41, 10, 1, 0),
(42, 'DAB008', 'I life Крем антивозрастной для области вокруг глаз с жемчугом', 10, 690, 534, 624, 534, 0, 0, 1, 0),
(43, 'DAB009', 'I life Перламутровая база под макияж с жемчугом', 10, 660, 510, 596, 510, 0, 0, 1, 0),
(44, 'DAA021', 'I life Пенистое жидкое мыло для рук с ромашкой', 20, 172, 38, 161, 40, 0, 0, 1, 0),
(45, 'ASB005', 'I life Питательный и увлажняющий гель для душа', 20, 272, 108, 242, 108, 0, 0, 1, 0),
(46, 'ASA001', 'I life Мягкий питательный шампунь ', 20, 229, 96, 218, 96, 0, 0, 1, 0),
(47, 'ASA002', 'I life Шампунь против перхоти', 20, 229, 98, 218, 96, -1, 0, 1, 0),
(48, 'DAA007', 'I life Бальзам для волос', 20, 244, 102, 232, 102, 0, 0, 1, 0),
(49, 'KAB001', 'Kardli Многофункциональная электролизная вода', 24, 309, 244, 275, 215, 21, 6, 1, 0),
(50, 'DAC004', 'I life Многофункциональное растительное очищающее средство (Базовый раствор + концентрат)', 20, 561, 453, 533, 453, 0, 0, 1, 0),
(51, 'DAA025', 'I life Микромолекулярная жидкость для стирки', 20, 197, 161, 187, 144, 30, 16, 1, 0),
(52, 'ASD001', 'I life Жидкость для мытья посуды', 20, 167, 135, 158, 135, 0, 0, 1, 0),
(53, 'ASF001', 'I life Жидкость для стирки', 20, 188, 52, 122, 52, 6, 4, 1, 0),
(54, 'DAC017', 'I life Средство от жира для кухни', 30, 114, 93, 108, 93, 15, 5, 1, 0),
(55, 'DAI001', 'Рослылитель (необходим для Средства от жира для кухни)', 200, 39, 14, 17, 14, 0, 0, 1, 0),
(56, 'DAC018', 'I life Средство для чистки туалетов', 30, 79, 63, 73, 63, 2, 0, 1, 0),
(57, 'KAC078', 'Мужские бамбуковые  следочки', 25, 398, 305, 356, 305, 0, 0, 1, 0),
(58, 'KAC176', 'I life мужские бамбуковые носки', 25, 506, 275, 481, 275, 0, 0, 1, 0),
(59, 'KAC174', 'I life женские бамбуковые носки', 25, 488, 265, 464, 265, 0, 0, 1, 0),
(60, 'KAC079', 'Женские бамбуковые следочки', 25, 357, 290, 339, 290, 0, 0, 1, 0),
(61, 'SFA001', 'SEALUXE Мужские духи ', 24, 490, 160, 465, 160, 0, 0, 1, 0),
(62, 'SCE005', 'SEALUXE Мягкая и безукоризненная компактная пудра', 24, 433, 352, 412, 352, 1, 0, 1, 0),
(63, 'JAG019', 'EASYLOVE Женские духи ', 24, 331, 93, 314, 93, 0, 0, 1, 0),
(64, 'JAG016', 'EASYLOVE Женские духи \"Звезда\"', 24, 395, 111, 375, 111, 0, 0, 1, 0),
(65, 'SCF001', 'Палетка для макияжа', 36, 456, 152, 433, 152, 2, 0, 1, 0),
(66, 'SCD004', 'SEALUXE  \"Хуа Ян\" Трехмерные румяна 01', 32, 286, 232, 271, 232, 0, 0, 1, 0),
(67, 'SCD005', 'SEALUXE  \"Хуа Ян\" Трехмерные румяна 02', 32, 286, 232, 271, 232, 1, 0, 1, 0),
(68, 'SCA005', 'SEALUXE легкий тонирующий крем 02', 36, 440, 179, 418, 179, 0, 0, 1, 0),
(69, 'SCA004', 'SEALUXE легкий тонирующий крем 01', 36, 440, 179, 418, 179, 0, 0, 1, 0),
(70, 'DAB025', 'I life Восстановливающий Гель Алоэ', 60, 145, 118, 138, 118, 0, 0, 1, 0),
(71, 'SBE022', 'SEALUXE  Подарочный косметический набор', 5, 3242, 1305, 3080, 1305, 0, 0, 1, 0),
(72, 'SCH007', 'SEALUXE  Четырехцветные тени для век  1.13g*4', 24, 412, 231, 391, 231, 0, 0, 1, 0),
(73, 'SCH006', 'SEALUXE Четырехцветные тени для век（Тыквенного цвета） 1.13г*4', 24, 412, 231, 391, 231, 0, 0, 1, 0),
(74, 'DAK001', 'Спрей для ног', 60, 196, 54, 186, 54, 1, 1, 1, 0),
(75, 'EAA003', 'YIBEILE Детская зубная щетка (одна)', 96, 35, 19, 34, 19, 0, 0, 1, 0),
(76, 'EAA004', 'YIBEILE Детская зубная щетка (одна)', 96, 35, 19, 33, 19, 0, 0, 1, 0),
(77, 'EAA010', 'YIBEILE Детская зубная щетка (одна)', 96, 35, 19, 33, 19, 0, 0, 1, 0),
(78, 'EAA009', 'YIBEILE Детская зубная щетка (две)', 72, 56, 31, 53, 31, 0, 0, 1, 0),
(79, 'SCB037', 'SEALUXE Матовая губная помада-карандаш (6 цветов：арбузный цвет; розовый цвет；вишнево-красный цвет；гранатовый красный цвет)', 48, 140, 114, 133, 114, 1, 0, 1, 0),
(80, 'SCB012', 'SEALUXE Матовая губная помада-карандаш (темный красный-цвет)', 48, 140, 111, 129, 111, 0, 0, 1, 0),
(81, 'SCB010', 'SEALUXE Матовая губная помада-карандаш ( розовый цвет)', 48, 140, 111, 129, 111, 0, 0, 1, 0),
(82, 'KAC142', 'Бамбуковые тапочки (м)', 50, 244, 57, 232, 57, 0, 0, 1, 0),
(83, 'KAC143', 'Бамбуковые тапочки (ж)', 50, 244, 57, 232, 57, 0, 0, 1, 0),
(84, 'NAG002', 'Nurich Черный чай с розой', 24, 260, 54, 247, 54, 0, 0, 1, 0),
(85, 'NAG006', 'Nurich Зеленый чай с жасмином', 24, 246, 51, 233, 51, 1, 0, 1, 0),
(86, 'NAG004', 'Nurich Зеленый чай Улун Османтусами', 24, 260, 54, 247, 54, 0, 0, 1, 0),
(87, 'NAG003', 'Nurich Зеленый чай с Морингой', 24, 270, 56, 257, 56, 0, 0, 1, 0),
(88, 'EBA001', 'YIBEILE Детское молочко для тела', 48, 233, 189, 221, 189, 0, 0, 1, 0),
(89, 'EAA001', 'YIBEILE Детский шампунь и гель для душа', 24, 354, 288, 337, 288, 0, 0, 1, 0),
(90, 'KAA004', 'Сковорода', 4, 2165, 443, 2057, 443, 0, 0, 1, 0),
(91, 'SCC001', 'Тушь черная удлиняет и подкручивает', 72, 226, 47, 215, 47, 2, 0, 1, 0),
(92, 'SBE012', 'Спрей для лица с беловой розой', 36, 409, 332, 388, 332, 0, 0, 1, 0),
(93, 'CBE003', 'Молочко для тела', 48, 115, 94, 110, 94, 0, 0, 1, 0),
(94, 'CBA004', 'Молочко для душа', 48, 137, 47, 130, 47, 0, 0, 1, 0),
(95, 'SZA005', 'Sealuxe  Зажим для ресниц', 48, 93, 19, 88, 19, 2, 0, 1, 0),
(96, 'CEA006', 'Туалетная бумага', 15, 446, 15, 424, 56, 0, 0, 1, 0),
(97, 'KAC105', 'Цветные хлопковые детские носки（XL）', 40, 220, 179, 209, 179, 0, 0, 1, 0),
(98, 'KAC104', 'Цветные хлопковые детские носки（L）', 40, 190, 155, 181, 155, 0, 0, 1, 0),
(99, 'KAC103', 'Цветные хлопковые детские носки（M）', 40, 184, 149, 174, 149, 0, 0, 1, 0),
(100, 'KAC102', 'Цветные хлопковые детские носки（S）', 40, 163, 132, 155, 132, 2, 0, 1, 0),
(101, 'ASG013', 'Крем для обуви（Бесцветный）', 48, 77, 27, 73, 27, 0, 0, 1, 0),
(102, 'ASG014', 'Крем для обуви（черный）', 48, 77, 27, 73, 27, 0, 0, 1, 0),
(103, 'CBC012', 'Детские влажные салфетки с молочко (25ш)', 72, 31, 6, 30, 6, 77, 5, 1, 0),
(104, 'CBC013', 'Детские влажные салфетки с молочко (80ш)', 24, 87, 31, 83, 31, 0, 0, 1, 0),
(105, 'SBE011', 'Питательный отбелеющий тоник с цветочным медом (120 мл)', 24, 470, 382, 446, 382, 0, 0, 1, 0),
(106, 'SBB015', 'Питательная отбелеющяя сыворотка с цветочным медом (40 мл)', 24, 434, 353, 413, 353, 0, 0, 1, 0),
(107, 'SBD007', 'Питательный отбелеющий  лосьон с цветочным медом (100 мл)', 24, 503, 409, 477, 409, 0, 0, 1, 0),
(108, 'DAJ080', 'I life  Листовое мыло с медом (100шт)', 80, 308, 251, 293, 251, 0, 0, 1, 0),
(109, 'CAB003', 'Carich Масло для волос', 24, 221, 180, 210, 180, 10, 4, 1, 0),
(110, 'SCB014', 'SEALUXE Жидкая губная помада（01）', 48, 181, 145, 169, 145, 0, 0, 1, 0),
(111, 'SCB016', 'SEALUXE Жидкая губная помада（02）', 48, 181, 147, 172, 147, 0, 0, 1, 0),
(112, 'SCB013', 'SEALUXE Жидкая губная помада（03）', 48, 181, 145, 169, 145, 0, 0, 1, 0),
(113, 'SCB015', 'SEALUXE Жидкая губная помада（04）', 48, 181, 147, 172, 147, 0, 0, 1, 0),
(114, 'SBC008', 'SEALUXE Рисовая успокаивающая маска', 30, 329, 93, 313, 93, 0, 0, 1, 0),
(115, 'CHA004', 'Carich Охлаждающая пена для бритья', 24, 124, 51, 117, 51, 0, 0, 1, 0),
(116, 'ASB021', 'I LIFE Омолаживающие, увлажняющие и очищающие средство для умывания (98 мл)', 10, 358, 291, 340, 291, 0, 0, 1, 0),
(117, 'ASB022', 'I LIFE Омоложений эластичный лосьон для кожи лица (75ml)', 10, 752, 612, 715, 612, 0, 0, 1, 0),
(118, 'ASB023', 'I LIFE Омоложения эластичная сыворотка для кожи лица (50ml)', 10, 766, 623, 728, 623, 0, 0, 1, 0),
(119, 'ASB024', 'I LIFE Омоложения эластичный крем для кожи лица (30g)', 10, 852, 630, 736, 630, 0, 0, 1, 0),
(120, 'ANA006', 'Ящик для демонстрации товаров', 1, 2100, 0, 2100, 0, 0, 0, 1, 0),
(121, 'CAB008', 'Маска для глубокого питания волос Carich 250g', 24, 264, 102, 239, 102, 6, 3, 1, 0),
(122, 'CCC018', 'Импортная антибактериальная зубная щетка с ионами серебра для взрослых Carich (1 шт)', 72, 91, 31, 83, 31, 0, 0, 1, 0),
(123, 'CCC019', 'Импортная антибактериальная зубная щетка с ионами серебра для взрослых Carich (2 шт)', 72, 111, 44, 101, 44, 13, 6, 1, 0),
(124, 'CEA014', 'Carich Влажная туалетная бумага 40 шт', 40, 69, 22, 63, 22, 10, 0, 1, 0),
(125, 'CEA015', ' Carich Влажная туалетная бумага 20 шт', 60, 41, 11, 37, 11, 0, 0, 1, 0),
(126, 'CEA016', 'Carich Влажная туалетная бумага с алоэ 40 шт', 40, 69, 22, 63, 22, 0, 0, 1, 0),
(127, 'CEA017', 'Carich Влажная туалетная бумага с алоэ 20 шт', 60, 41, 11, 37, 11, 11, 5, 1, 0),
(128, 'CEA019', 'Carich Влажные салфетки для интимной гигены для женщин 20 шт', 60, 41, 11, 37, 11, 0, 0, 1, 0),
(129, 'CEA020', 'Carich Влажные салфетки для кухни с ароматом лайма 40 шт', 24, 121, 24, 110, 24, 0, 0, 1, 0),
(130, 'CEA021', 'Carich Влажные салфетки для кухни с ароматом апельсина  40 шт', 24, 121, 24, 110, 24, 0, 0, 1, 0),
(131, 'CGA062', 'Carich Косметичка', 24, 252, 53, 228, 53, 0, 0, 1, 0),
(132, 'CGA064', 'Carich Косметичка прямоугольная', 24, 254, 62, 230, 62, 0, 0, 1, 0),
(133, 'DAA014', 'I life Кондиционер для белья ароматом сирени  1kg', 20, 183, 55, 165, 55, 3, 1, 1, 0),
(134, 'DAA015', 'I life Кондиционер для белья ароматом лаванды 1kg', 20, 183, 55, 165, 55, 0, 0, 1, 0),
(135, 'DAA022', 'I life Пенистое жидкое мыло для рук с  лимоном 500ml', 20, 172, 38, 156, 38, 0, 0, 1, 0),
(136, 'DAA023', 'I life Пенистое жидкое мыло для рук с алоэ  500ml', 20, 172, 39, 158, 39, 0, 0, 1, 0),
(137, 'DAA024', 'I life Пенистое жидкое мыло для рук с гранатом  500ml', 20, 172, 38, 156, 38, 0, 0, 1, 0),
(138, 'DAB039', 'I life Глубоко увлажняющий активирующий гель для кожи вокруг глаз 15g', 24, 323, 251, 293, 251, 0, 0, 1, 0),
(139, 'DAB043', 'I life Увлажняющий гель для кожи вокруг глаз с гилауроновой кислотой 15ml', 48, 362, 281, 328, 281, 0, 0, 1, 0),
(140, 'JAG024', 'Easylove Духи \"Звезда\"лазурь 50ml', 24, 489, 131, 442, 131, 10, 5, 1, 0),
(141, 'JAG025', 'EasyloveДухи \"Звезда\" пурпурные мелодии  50ml', 24, 489, 131, 442, 131, 0, 0, 1, 0),
(142, 'JAG026', 'Easylove Духи \"Звезда\" темная зелень 50ml', 24, 489, 131, 442, 131, 0, 0, 1, 0),
(143, 'KAC177', 'Kardli Женские гольфы', 25, 567, 280, 513, 280, 3, 0, 1, 0),
(144, 'KAC179', 'Kardli Мужские гольфы', 25, 585, 289, 529, 289, 0, 0, 1, 0),
(145, 'SAA013', 'SEALUXE Освежающий гель для очистки лица для мужчин 120g', 20, 149, 77, 135, 77, 0, 0, 1, 0),
(146, 'SAA015', 'SEALUXE Гель для душа с лепестками календулы 235ml', 20, 146, 68, 132, 68, 1, 0, 1, 0),
(147, 'SAA016', 'SEALUXE Гель для душа с лепестками османтуса 235ml', 20, 147, 69, 133, 69, 0, 0, 1, 0),
(148, 'SAA017', 'SEALUXE Гель для душа с лепестками жасмина 235ml', 20, 144, 67, 130, 67, 0, 0, 1, 0),
(149, 'SAA018', 'SEALUXE  Гель для душа с лепестками софлоры 235ml', 20, 144, 67, 130, 67, 0, 0, 1, 0),
(150, 'SBB016', 'SEALUXE База под макияж', 36, 432, 335, 392, 335, 0, 0, 1, 0),
(151, 'SBE013', 'SEALUXE Мужской спрей для тела 50ml', 20, 158, 44, 143, 44, 0, 0, 1, 0),
(152, 'SCB025', 'SEALUXE Сияющая губная помада (темно- красный цвет)', 36, 197, 153, 179, 153, 6, 1, 1, 0),
(153, 'SCB042', 'SEALUXE Ослепительная помада  (Золотой цвет） 3g', 36, 252, 195, 228, 195, 1, 0, 1, 0),
(154, 'CIA015', 'Carich Согревающая паровая маска для глаз с зеленым чаем', 40, 291, 119, 263, 119, 0, 0, 1, 0),
(155, 'CIA016', 'Carich Согревающая паровая маска для глаз натуральная без запаха', 40, 291, 119, 263, 119, 0, 0, 1, 0),
(156, 'DAC019', 'I life Супер Средство от жира для кухни 500 мл', 24, 124, 96, 112, 96, 14, 12, 1, 0),
(157, 'DAC020', 'I life Супер Средство для чистки туалетов 500 мл', 24, 92, 71, 83, 71, 34, 27, 1, 0),
(158, 'DAD032', 'I life Ухаживающие вкладыши для женщин 12 шт', 20, 303, 161, 273, 161, 9, 2, 1, 0),
(159, 'DAK002', 'I life Ухаживающие вкладыши для мужчин 12 шт', 20, 303, 161, 273, 161, 0, 0, 1, 0),
(160, 'KAC082', 'Kardli Ilife Детские трусы-брифы размер M', 30, 498, 108, 451, 108, 0, 0, 1, 0),
(161, 'KAC083', 'Kardli Ilife Детские трусы-брифы размер L', 30, 498, 108, 451, 108, 0, 0, 1, 0),
(162, 'KAC084', 'Kardli Ilife Детские трусы-боксеры размер S', 30, 498, 108, 451, 108, 0, 0, 1, 0),
(163, 'KAC088', 'Kardli Банное полотенце белое Kardli Ilife', 30, 536, 89, 484, 89, 0, 0, 1, 0),
(164, 'KAC171', 'Kardli Женские подследники', 25, 480, 245, 434, 245, 0, 0, 1, 0),
(165, 'KAC172', 'Kardli Подследники женские Kardli (ярких цветов)', 25, 480, 245, 434, 245, 0, 0, 1, 0),
(166, 'KAC173', 'Kardli мужские подследники', 25, 499, 254, 451, 254, 2, 0, 1, 0),
(167, 'KAC178', 'Kardli Гольфы женские Kardli (ярких цветов)', 25, 567, 280, 513, 280, 0, 0, 1, 0),
(168, 'MAD369', 'MARVISIA Плотные колготки слабой компрессии  (цвет черный)', 50, 288, 56, 260, 56, 0, 0, 1, 0),
(169, 'MAD370', 'MARVISIA  Плотные колготки слабой компрессии  (цвет телесный)', 50, 288, 56, 260, 56, 0, 0, 1, 0),
(170, 'MAD371', 'MARVISIA Колготки со слабым утягивающим эффектом  (цвет черный)', 50, 331, 72, 299, 72, 0, 0, 1, 0),
(171, 'MAD372', 'MARVISIA Колготки со слабым утягивающим эффектом  (цвет телесный)', 50, 331, 72, 299, 72, 0, 0, 1, 0),
(172, 'MAD381', 'MARVISIA Мужские трусы-боксеры  Паркур размер М (цвет темно-синий голубой)', 30, 777, 151, 703, 151, 0, 0, 1, 0),
(173, 'MAD385', 'MARVISIA Мужские трусы-боксеры Паркур размер М (цвет темно-синий серый меланж)', 30, 777, 151, 703, 151, 0, 0, 1, 0),
(174, 'MAD389', 'MARVISIA Мужские трусы-боксеры Паркур размер М (цвет голубой серый меланж)', 30, 777, 151, 703, 151, 0, 0, 1, 0),
(175, 'MAD390', 'MARVISIA Мужские трусы-боксеры Паркур размер L (цвет голубой  серый меланж)', 30, 777, 151, 703, 151, 0, 0, 1, 0),
(176, 'MAD391', 'MARVISIA Мужские трусы-боксеры Паркур размер XL (цвет голубой серый меланж)', 30, 777, 151, 703, 151, 0, 0, 1, 0),
(177, 'MAD392', 'MARVISIA Мужские трусы-боксеры Паркур размер XXL (цвет голубой серый меланж)', 30, 777, 151, 703, 151, 0, 0, 1, 0),
(178, 'MAD524', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер S, черный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(179, 'MAD525', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер М, черный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(180, 'MAD526', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер L, черный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(181, 'MAD527', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер XL, черный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(182, 'MAD528', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер S, телесный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(183, 'MAD529', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер М, телесный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(184, 'MAD530', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер L, телесный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(185, 'MAD531', 'MARVISIA Декомпрессионный спортивный бюстгальтер, размер XL, телесный', 16, 1294, 291, 1171, 291, 0, 0, 1, 0),
(186, 'SBC014', 'SEALUXE Успокаивающая увлажняющая маска для лица Алоэ', 30, 284, 76, 257, 76, 0, 0, 1, 0),
(187, 'SBF001', 'SEALUXE Лифтинг-крем для век Ослепительное сияние', 48, 417, 323, 377, 323, 0, 0, 1, 0),
(188, 'CCA005', 'Сагich Натуральная зубная паста на основе мяты  (120g)', 60, 117, 33, 95, 31, 1, 0, 1, 0),
(189, 'CCA013', 'Сагich Натуральная зубная паста на основе зеленого чая  (120g)', 60, 117, 31, 95, 31, 0, 0, 1, 0),
(190, 'CCB005', 'Сагich Cпрей для полости рта (зеленый чай) (10ml)', 300, 65, 47, 54, 47, 63, 50, 1, 0),
(191, 'DAB038', 'I life Увлажняющяя сыворотка с гилауроновой кислотой 30ml', 48, 250, 185, 216, 185, 0, 0, 1, 0),
(192, 'DAC011', 'I life Чистящая таблетка для унитаза ', 24, 126, 33, 109, 33, 0, 0, 1, 0),
(193, 'KAC210', 'Kardli Пакеты для мусора', 36, 228, 17, 197, 17, 1, 0, 1, 0),
(194, 'SBA018', 'Sealuxe Питательный отбелеющий крем с цветочным медом (50мл)', 24, 446, 330, 386, 330, 0, 0, 1, 0),
(195, 'SBA024', 'Sealuxe Питательный крем для шеи (60ml)', 20, 325, 240, 281, 240, 0, 0, 1, 0),
(196, 'CAA012', 'Carich Шампунь с экстрактом бамбука 450 мл', 20, 269, 234, 223, 234, 0, 0, 1, 0),
(197, 'KAC090', 'Kardli iLife Детское банное полотенце', 30, 898, 238, 742, 238, 0, 0, 1, 0),
(198, 'EAB003', 'YIBEILE Детское жидкое мыло для рук Yibeile (с клубничным ароматом)', 20, 168, 44, 139, 44, 0, 0, 1, 0),
(199, 'DAA026', 'iLife  Освежающий шампунь от перхоти 500 мл', 20, 366, 167, 302, 167, 1, 0, 1, 0),
(200, 'DAC010', 'iLife Моющее средство для стиральных машин 125 г*3*36', 36, 128, 48, 106, 48, 3, 2, 1, 0),
(201, 'CCA005', '卡丽施120g薄荷冰爽牙膏（每箱60盒）', 60, 130, 42, 107, 42, 0, 0, 1, 0),
(202, 'CFA002', 'Carich Блокнот 168 мм X 228 мм', 60, 291, 58, 240, 58, 0, 0, 1, 0),
(203, 'CFA004', 'Carich Блокнот с мягкой обложкой 168 мм X 228 мм ', 60, 305, 62, 252, 62, 0, 0, 1, 0),
(204, 'MAD612', 'MARVISIA Женские трусы со средней талией 1117 ', 100, 231, 56, 191, 56, 0, 0, 1, 0),
(205, 'DAC026', 'iLife  Твердое средство для чистки труб 268 г', 30, 156, 77, 130, 77, 2, 1, 1, 0),
(206, 'ASF004', 'iLife Автомобильное моющее средство 250 мл', 12, 128, 49, 106, 49, 3, 0, 1, 0),
(207, 'NAZ172', 'Nilrich Молочный чай Улун 500 мл', 60, 128, 37, 105, 37, 0, 0, 1, 0),
(208, 'NAG010', 'Nilrich Чай из корня лопуха 90 г', 20, 455, 87, 376, 87, 0, 0, 1, 0),
(209, 'NAG013', 'Nilrich Черный чай Индэ 75 г', 24, 927, 176, 766, 176, 0, 0, 1, 0),
(210, 'NAG008', 'Nilrich Обогащенный селеном лимонный черный чай 72 г', 36, 549, 136, 453, 136, 0, 0, 1, 0),
(211, 'NAZ173', 'Nilrich Японский молочный чай со вкусом матча 500 мл', 60, 128, 37, 105, 37, 0, 0, 1, 0),
(212, 'KAA015', 'Kardli Плоская сковорода диаметром 26 см ', 6, 1163, 311, 960, 311, 0, 0, 1, 0),
(213, 'DAD015', 'I life Мини Гигиенические прокладки100% хлопок (дневные) 10 шт', 100, 63, 33, 57, 33, 55, 12, 1, 0),
(214, 'JCK004', 'Многофункциональные герметичные пакеты 3M 20 шт в упаковке (размер S)', 30, 279, 57, 233, 57, 0, 0, 1, 0),
(215, 'CBE010', 'Сагich Увлажняющий крем для ног с имбирем', 36, 100, 39, 82, 39, 24, 10, 1, 0),
(216, 'KAC087', 'Kardli Ilife Полотенце (Сплошной цвет)', 100, 157, 21, 136, 21, 0, 0, 1, 0),
(217, 'ASB027', 'I Life 50 г Крем для рук Гранат ( 50 г)', 36, 87, 29, 78, 29, 0, 0, 1, 0),
(218, 'ASB028', 'I Life 50 г Крем для рук Алоэ ( 50 г)', 36, 87, 29, 78, 29, 34, 5, 1, 0),
(219, 'ASG011', 'I life Крем для обуви жидкий (коричневый) 75 мл', 48, 83, 28, 75, 28, 0, 0, 1, 0),
(220, 'ASG012', 'Крем для обуви жидкий (бесцветный) ILife 75 мл', 48, 83, 28, 75, 28, 0, 0, 1, 0),
(221, 'CAA006', 'Carich Шампунь для волос \"Мягкость и шелк\"  285 мл', 20, 281, 109, 254, 109, 0, 0, 1, 0),
(222, 'CAB006', 'Carich  Бальзам-ополаскиватель для волос \"Мягкость и шелк\"  285 мл', 20, 245, 95, 221, 95, 0, 0, 1, 0),
(223, 'CBE002', 'Carich  Многофункциональный восстанавливающий крем на основе конского жира 100 г', 24, 240, 185, 216, 185, 0, 0, 1, 0),
(224, 'CBE007', 'Carich  Массажный скраб для ног 180 г', 24, 211, 109, 191, 109, 3, 3, 1, 0),
(225, 'CCC005', 'Carich Флосс-зубочистки с плоской нитью и бамбуковым углем (в коробке)', 12, 73, 19, 65, 19, 0, 0, 1, 0),
(226, 'CIA007', 'Carich РЕ Микропористый лейкопластырь（60 шт. в упаковке）', 60, 84, 33, 76, 33, 1, 0, 1, 0),
(227, 'CIA008', 'Carich  Эластичный лейкопластырь （40 шт. в упаковке)', 60, 81, 34, 73, 31, 0, 0, 1, 0),
(228, 'CIA009', 'Carich Прозрачный водостойкий лейкопластырь （40 шт. в упаковке）', 60, 110, 34, 100, 34, 0, 0, 1, 0),
(229, 'CIA010', 'Carich Лейкопластырь с рисунками из мультфильмов РЕ（ 50 шт. в упаковке）', 60, 102, 34, 92, 34, 0, 0, 1, 0),
(230, 'CIA012', 'Carich  Согревающая паровая маска для глаз с лавандой', 40, 291, 119, 263, 119, 0, 0, 1, 0),
(231, 'CIA013', 'Carich Согревающая паровая маска для глаз с ромашкой', 40, 291, 119, 263, 119, 0, 0, 1, 0),
(232, 'SCE021', 'SEALUXE База под макияж матирующая лицо (Зеленого цвета для \"Светящейся\" кожи) 30г', 18, 340, 101, 294, 101, 4, 3, 1, 0),
(233, 'SCE020', 'SEALUXE База под макияж матирующая лицо (Фиолетового цвета для нежности кожи ）30г', 18, 340, 101, 294, 101, 3, 3, 1, 0),
(234, 'SBB017', 'SEALUXE Мужская питательная эссенция \"все в одном\" 50г', 20, 417, 176, 360, 176, 0, 0, 1, 0),
(235, 'NAZ204', 'NILRICH Ягоды годжи 258 г', 16, 657, 140, 567, 140, 0, 0, 1, 0),
(236, 'KAC055', 'KARDLI  ILIFE Бумажный стаканчик из бамбукового волокна 250 мл', 40, 149, 34, 129, 34, 0, 0, 1, 0),
(237, 'DAA037', 'ILIFE Антибактериальный стиральный порошок с экстрактом бамбука 1 кг', 20, 229, 73, 198, 73, 0, 0, 1, 0),
(238, 'CIA022', 'KARICH Травяной пластырь для стоп для лучшего сна 20 пластырей', 40, 275, 128, 238, 128, 0, 0, 1, 0),
(239, 'CGA001', 'KARICH Клейкий ролик для дома（60 полос）', 100, 64, 20, 55, 20, 21, 3, 1, 0),
(240, 'CCC001', 'KARICH Зубная щетка с тонкими щетинками с древесным углем（В упаковке 2 шт）', 72, 75, 37, 65, 37, 0, 0, 1, 0),
(241, 'CCB013', 'KARICH Жидкость для полоскания рта 500мл.（Вкус мяты）Версия на русском языке', 20, 188, 139, 162, 139, 2, 0, 1, 0),
(242, 'CBE006', 'KARICH Смягчающий заживляющий крем для ног и рук с лошадиным маслом 100 г', 24, 215, 159, 186, 159, 5, 0, 1, 0),
(243, 'CAD002', 'KARICH Массажная расческа на воздушной подушке', 36, 164, 37, 142, 37, 0, 0, 1, 0),
(244, 'CAD001', 'KARICH Круглая расческа для укладки волос', 36, 139, 41, 120, 41, 0, 0, 1, 0),
(245, 'KAC140', 'Бамбуковые тапочки (м)', 50, 249, 57, 237, 55, 22, 20, 1, 0),
(246, 'KAC141', 'Бамбуковые тапочки (ж)', 50, 249, 57, 237, 55, 0, 0, 1, 0),
(247, '000000', 'Пакет Greenleaf', 50, 15, 0, 5, 0, 347, 35, 1, 0),
(248, 'CAA007', 'KARICH Шампунь двойного действия 500 мл', 20, 275, 102, 237, 102, 2, 1, 1, 0);

-- --------------------------------------------------------

--
-- Структура таблицы `PURCHASE_INVOICE`
--

CREATE TABLE `PURCHASE_INVOICE` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `NUMBER` int(11) NOT NULL DEFAULT '0' COMMENT 'номер накладной',
  `ID_ACCOUNT` int(11) NOT NULL DEFAULT '0' COMMENT 'ID создателя накладной',
  `ID_COUNTERPARTY` int(11) NOT NULL DEFAULT '0' COMMENT 'ID контрагента',
  `DATE` date DEFAULT NULL COMMENT 'дата проведения накладной',
  `CREATE_DATE` date DEFAULT NULL COMMENT 'дата создания накладной',
  `COST` double NOT NULL DEFAULT '0' COMMENT 'итоговая стоимость по накладной',
  `COUPON` double NOT NULL DEFAULT '0' COMMENT 'итоговый купон по накладной',
  `IS_ISSUED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак проведенной накладной',
  `IS_LOCKED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак заблокированной накладной'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Приходные накладные' ROW_FORMAT=COMPACT;

-- --------------------------------------------------------

--
-- Структура таблицы `PURCHASE_INVOICE_UNIT`
--

CREATE TABLE `PURCHASE_INVOICE_UNIT` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `ID_INVOICE` int(11) NOT NULL COMMENT 'ID приходной накладной',
  `ID_PRODUCT` int(11) NOT NULL COMMENT 'ID товара',
  `COUNT` int(11) NOT NULL COMMENT 'количество товара',
  `PRODUCT_COST` double NOT NULL COMMENT 'стоимость товара',
  `PRODUCT_COUPON` double NOT NULL COMMENT 'купон товара',
  `COST` double NOT NULL COMMENT 'итоговая стоимость',
  `COUPON` double NOT NULL COMMENT 'итоговый купон'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Элементы приходных накладных' ROW_FORMAT=COMPACT;

-- --------------------------------------------------------

--
-- Структура таблицы `SALES_INVOICE`
--

CREATE TABLE `SALES_INVOICE` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `NUMBER` int(11) NOT NULL DEFAULT '0' COMMENT 'номер накладной',
  `ID_ACCOUNT` int(11) NOT NULL DEFAULT '0' COMMENT 'ID создателя накладной',
  `ID_COUNTERPARTY` int(11) NOT NULL DEFAULT '0' COMMENT 'ID контрагента',
  `DATE` date DEFAULT NULL COMMENT 'дата проведения накладной',
  `CREATE_DATE` date DEFAULT NULL COMMENT 'дата создания накладной',
  `COST` double NOT NULL DEFAULT '0' COMMENT 'итоговая стоимость по накладной',
  `COUPON` double NOT NULL DEFAULT '0' COMMENT 'итоговый купон по накладной',
  `IS_ISSUED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак проведенной накладной',
  `IS_LOCKED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак заблокированной накладной'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Расходные накладные' ROW_FORMAT=COMPACT;

-- --------------------------------------------------------

--
-- Структура таблицы `SALES_INVOICE_UNIT`
--

CREATE TABLE `SALES_INVOICE_UNIT` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `ID_INVOICE` int(11) NOT NULL COMMENT 'ID расходной накладной',
  `ID_PRODUCT` int(11) NOT NULL COMMENT 'ID товара',
  `COUNT` int(11) NOT NULL COMMENT 'количество товара',
  `PRODUCT_COST` double NOT NULL COMMENT 'стоимость товара',
  `PRODUCT_COUPON` double NOT NULL COMMENT 'купон товара',
  `COST` double NOT NULL COMMENT 'итоговая стоимость',
  `COUPON` double NOT NULL COMMENT 'итоговый купон'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Элементы расходных накладных' ROW_FORMAT=COMPACT;

-- --------------------------------------------------------

--
-- Структура таблицы `SETTINGS`
--

CREATE TABLE `SETTINGS` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `NOMINATION` varchar(100) COLLATE utf8_unicode_ci NOT NULL COMMENT 'наименование настройки',
  `VALUE` varchar(1000) COLLATE utf8_unicode_ci NOT NULL COMMENT 'значение настройки'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Настройки' ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `SETTINGS`
--

INSERT INTO `SETTINGS` (`ID`, `NOMINATION`, `VALUE`) VALUES
(1, 'Наименование организации для накладной', 'СЦ Greenleaf Тольятти'),
(2, 'Код сервисного центра', 'S070058'),
(3, 'RU владельца СЦ', 'RU05817053'),
(4, 'Путь к расходным накладным', 'C:\\Расходные накладные\\'),
(5, 'Путь к приходным накладным', 'D:\\Приходные накладные\\');

-- --------------------------------------------------------

--
-- Структура таблицы `UNIT`
--

CREATE TABLE `UNIT` (
  `ID` int(11) NOT NULL COMMENT 'идентификатор',
  `NOMINATION` varchar(255) CHARACTER SET utf8 COLLATE utf8_unicode_ci NOT NULL COMMENT 'наименование единицы измерения',
  `IS_ANNULATED` tinyint(1) NOT NULL DEFAULT '0' COMMENT 'признак аннулированной единицы измерения'
) ENGINE=InnoDB DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci COMMENT='Единицы измерения' ROW_FORMAT=COMPACT;

--
-- Дамп данных таблицы `UNIT`
--

INSERT INTO `UNIT` (`ID`, `NOMINATION`, `IS_ANNULATED`) VALUES
(1, 'шт', 0),
(2, 'кг', 0),
(3, 'г', 0),
(4, 'мл', 0),
(5, 'пара', 0);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `ACCOUNT`
--
ALTER TABLE `ACCOUNT`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `ID` (`ID`),
  ADD UNIQUE KEY `ID_2` (`ID`),
  ADD UNIQUE KEY `ID_3` (`ID`),
  ADD UNIQUE KEY `ID_4` (`ID`);

--
-- Индексы таблицы `COUNTERPARTY`
--
ALTER TABLE `COUNTERPARTY`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `CODE` (`CODE`);

--
-- Индексы таблицы `JOURNAL`
--
ALTER TABLE `JOURNAL`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `NUMERATOR`
--
ALTER TABLE `NUMERATOR`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `PRODUCT`
--
ALTER TABLE `PRODUCT`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `PURCHASE_INVOICE`
--
ALTER TABLE `PURCHASE_INVOICE`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `PURCHASE_INVOICE_UNIT`
--
ALTER TABLE `PURCHASE_INVOICE_UNIT`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `SALES_INVOICE`
--
ALTER TABLE `SALES_INVOICE`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `SALES_INVOICE_UNIT`
--
ALTER TABLE `SALES_INVOICE_UNIT`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `SETTINGS`
--
ALTER TABLE `SETTINGS`
  ADD PRIMARY KEY (`ID`);

--
-- Индексы таблицы `UNIT`
--
ALTER TABLE `UNIT`
  ADD PRIMARY KEY (`ID`),
  ADD UNIQUE KEY `NAME` (`NOMINATION`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `ACCOUNT`
--
ALTER TABLE `ACCOUNT`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор', AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT для таблицы `COUNTERPARTY`
--
ALTER TABLE `COUNTERPARTY`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор', AUTO_INCREMENT=65;

--
-- AUTO_INCREMENT для таблицы `JOURNAL`
--
ALTER TABLE `JOURNAL`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор';

--
-- AUTO_INCREMENT для таблицы `NUMERATOR`
--
ALTER TABLE `NUMERATOR`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор', AUTO_INCREMENT=3;

--
-- AUTO_INCREMENT для таблицы `PRODUCT`
--
ALTER TABLE `PRODUCT`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор', AUTO_INCREMENT=249;

--
-- AUTO_INCREMENT для таблицы `PURCHASE_INVOICE`
--
ALTER TABLE `PURCHASE_INVOICE`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор';

--
-- AUTO_INCREMENT для таблицы `PURCHASE_INVOICE_UNIT`
--
ALTER TABLE `PURCHASE_INVOICE_UNIT`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор';

--
-- AUTO_INCREMENT для таблицы `SALES_INVOICE`
--
ALTER TABLE `SALES_INVOICE`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор';

--
-- AUTO_INCREMENT для таблицы `SALES_INVOICE_UNIT`
--
ALTER TABLE `SALES_INVOICE_UNIT`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор';

--
-- AUTO_INCREMENT для таблицы `SETTINGS`
--
ALTER TABLE `SETTINGS`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор', AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT для таблицы `UNIT`
--
ALTER TABLE `UNIT`
  MODIFY `ID` int(11) NOT NULL AUTO_INCREMENT COMMENT 'идентификатор', AUTO_INCREMENT=6;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
